{"keras_version": "2.0.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "linear", "filters": 32, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 32, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "trainable": true, "units": 64, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "trainable": true, "units": 1, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}]}